class CriteriaModel {
  final String title;
  final List<String> points;

  CriteriaModel({required this.title, required this.points});
}

final List<CriteriaModel> dummyCriteriaList = [
  CriteriaModel(
    title: "1. الإنجازات الرياضية:",
    points: [
      "الأداء المتميز في البطولات الكبرى (الأولمبياد، بطولات العالم، البطولات القارية).",
      "تحقيق أرقام قياسية عالمية أو قارية أو وطنية.",
      "الاستمرارية في تحقيق النتائج الإيجابية على مدار العام.",
    ],
  ),
  CriteriaModel(
    title: "2. الروح الرياضية والأخلاق:",
    points: [
      "الالتزام بقواعد اللعب النظيف والمنافسة الشريفة.",
      "احترام المنافسين والحكام والجماهير.",
      "أن يكون قدوة حسنة للشباب والرياضيين الآخرين.",
    ],
  ),
  CriteriaModel(
    title: "3. التأثير والإلهام:",
    points: [
      "مدى تأثير الرياضي في مجتمعه ورياضته.",
      "تشجيع ودعم الآخرين لتحقيق طموحاتهم.",
      "المبادرات المجتمعية والخيرية (إن وجدت).",
    ],
  ),
  CriteriaModel(
    title: "4. معايير خاصة بالمدربين:",
    points: [
      "القدرة على تطوير أداء اللاعبين والفرق.",
      "الابتكار في الخطط التدريبية والتكتيك.",
      "نقل المعرفة والمعلومات لمن يقوم بتدريبهم.",
    ],
  ),
  CriteriaModel(
    title: "5. معايير خاصة بالفرق:",
    points: [
      "الأداء الجماعي المتميز والعمل بروح الفريق.",
      "تحقيق نتائج جماعية بارزة.",
    ],
  ),
];
